app/controllers/school_classes_controller.rb

  def update
    @school_class = SchoolClass.find_by(id: params[:id])
    @school_class.update(school_class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2017-09-05 15:24:06.735680"], ["id", 1]]